---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPSection.VelocityPressure
source: html/6aba4956-8313-11cf-2bcc-c608aa9d97df.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSection.VelocityPressure Property

The velocity pressure of the section.

## Syntax (C#)
```csharp
public double VelocityPressure { get; }
```

## Remarks
Default unit is Kgf per square feet.
 For Duct, unit type is UT_HVAC_Pressure.
 For Pipe, unit type is UT_Piping_Pressure